---
kind: type
id: T:Autodesk.Revit.UI.FileDialog
source: html/99bb6529-12de-a126-50f7-39346dd5b48d.htm
---
# Autodesk.Revit.UI.FileDialog

Base class supporting display of the dialog used to navigate to and select a file from Autodesk Revit.

## Syntax (C#)
```csharp
public class FileDialog : IDisposable
```